SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_eusart.h
#define EUSART_CFG1_RXFIW_ONEFRAME              (_EUSART_CFG1_RXFIW_ONEFRAME << 27)     /**< Shifted mode ONEFRAME for EUSART_CFG1       */
#define EUSART_CFG1_RXFIW_TWOFRAMES             (_EUSART_CFG1_RXFIW_TWOFRAMES << 27)    /**< Shifted mode TWOFRAMES for EUSART_CFG1      */
#define EUSART_CFG1_RXFIW_THREEFRAMES           (_EUSART_CFG1_RXFIW_THREEFRAMES << 27)  /**< Shifted mode THREEFRAMES for EUSART_CFG1    */
#define EUSART_CFG1_RXFIW_FOURFRAMES            (_EUSART_CFG1_RXFIW_FOURFRAMES << 27)   /**< Shifted mode FOURFRAMES for EUSART_CFG1     */
#define EUSART_CFG1_RXFIW_FIVEFRAMES            (_EUSART_CFG1_RXFIW_FIVEFRAMES << 27)   /**< Shifted mode FIVEFRAMES for EUSART_CFG1     */
#define EUSART_CFG1_RXFIW_SIXFRAMES             (_EUSART_CFG1_RXFIW_SIXFRAMES << 27)    /**< Shifted mode SIXFRAMES for EUSART_CFG1      */
#define EUSART_CFG1_RXFIW_SEVENFRAMES           (_EUSART_CFG1_RXFIW_SEVENFRAMES << 27)  /**< Shifted mode SEVENFRAMES for EUSART_CFG1    */
#define EUSART_CFG1_RXFIW_EIGHTFRAMES           (_EUSART_CFG1_RXFIW_EIGHTFRAMES << 27)  /**< Shifted mode EIGHTFRAMES for EUSART_CFG1    */
#define EUSART_CFG1_RXFIW_NINEFRAMES            (_EUSART_CFG1_RXFIW_NINEFRAMES << 27)   /**< Shifted mode NINEFRAMES for EUSART_CFG1     */
#define EUSART_CFG1_RXFIW_TENFRAMES             (_EUSART_CFG1_RXFIW_TENFRAMES << 27)    /**< Shifted mode TENFRAMES for EUSART_CFG1      */
#define EUSART_CFG1_RXFIW_ELEVENFRAMES          (_EUSART_CFG1_RXFIW_ELEVENFRAMES << 27) /**< Shifted mode ELEVENFRAMES for EUSART_CFG1   */
#define EUSART_CFG1_RXFIW_TWELVEFRAMES          (_EUSART_CFG1_RXFIW_TWELVEFRAMES << 27) /**< Shifted mode TWELVEFRAMES for EUSART_CFG1   */
#define EUSART_CFG1_RXFIW_THIRTEENFRAMES        (_EUSART_CFG1_RXFIW_THIRTEENFRAMES << 27) /**< Shifted mode THIRTEENFRAMES for EUSART_CFG1 */
#define EUSART_CFG1_RXFIW_FOURTEENFRAMES        (_EUSART_CFG1_RXFIW_FOURTEENFRAMES << 27) /**< Shifted mode FOURTEENFRAMES for EUSART_CFG1 */
#define EUSART_CFG1_RXFIW_FIFTEENFRAMES         (_EUSART_CFG1_RXFIW_FIFTEENFRAMES << 27) /**< Shifted mode FIFTEENFRAMES for EUSART_CFG1  */
#define EUSART_CFG1_RXFIW_SIXTEENFRAMES         (_EUSART_CFG1_RXFIW_SIXTEENFRAMES << 27) /**< Shifted mode SIXTEENFRAMES for EUSART_CFG1  */

/* Bit fields for EUSART CFG2 */
#define _EUSART_CFG2_RESETVALUE                 0x00000020UL                            /**< Default value for EUSART_CFG2               */
#define _EUSART_CFG2_MASK                       0xFF0000FFUL                            /**< Mask for EUSART_CFG2                        */
#define EUSART_CFG2_MASTER                      (0x1UL << 0)                            /**< Main mode                                   */
#define _EUSART_CFG2_MASTER_SHIFT               0                                       /**< Shift value for EUSART_MASTER               */
#define _EUSART_CFG2_MASTER_MASK                0x1UL                                   /**< Bit mask for EUSART_MASTER                  */
#define _EUSART_CFG2_MASTER_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for EUSART_CFG2                */
#define _EUSART_CFG2_MASTER_SLAVE               0x00000000UL                            /**< Mode SLAVE for EUSART_CFG2                  */
#define _EUSART_CFG2_MASTER_MASTER              0x00000001UL                            /**< Mode MASTER for EUSART_CFG2                 */
#define EUSART_CFG2_MASTER_DEFAULT              (_EUSART_CFG2_MASTER_DEFAULT << 0)      /**< Shifted mode DEFAULT for EUSART_CFG2        */
#define EUSART_CFG2_MASTER_SLAVE                (_EUSART_CFG2_MASTER_SLAVE << 0)        /**< Shifted mode SLAVE for EUSART_CFG2          */
#define EUSART_CFG2_MASTER_MASTER               (_EUSART_CFG2_MASTER_MASTER << 0)       /**< Shifted mode MASTER for EUSART_CFG2         */
#define EUSART_CFG2_CLKPOL                      (0x1UL << 1)                            /**< Clock Polarity                              */
#define _EUSART_CFG2_CLKPOL_SHIFT               1                                       /**< Shift value for EUSART_CLKPOL               */
#define _EUSART_CFG2_CLKPOL_MASK                0x2UL                                   /**< Bit mask for EUSART_CLKPOL                  */
#define _EUSART_CFG2_CLKPOL_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for EUSART_CFG2                */
#define _EUSART_CFG2_CLKPOL_IDLELOW             0x00000000UL                            /**< Mode IDLELOW for EUSART_CFG2                */
#define _EUSART_CFG2_CLKPOL_IDLEHIGH            0x00000001UL                            /**< Mode IDLEHIGH for EUSART_CFG2               */
#define EUSART_CFG2_CLKPOL_DEFAULT              (_EUSART_CFG2_CLKPOL_DEFAULT << 1)      /**< Shifted mode DEFAULT for EUSART_CFG2        */
#define EUSART_CFG2_CLKPOL_IDLELOW              (_EUSART_CFG2_CLKPOL_IDLELOW << 1)      /**< Shifted mode IDLELOW for EUSART_CFG2        */
#define EUSART_CFG2_CLKPOL_IDLEHIGH             (_EUSART_CFG2_CLKPOL_IDLEHIGH << 1)     /**< Shifted mode IDLEHIGH for EUSART_CFG2       */
#define EUSART_CFG2_CLKPHA                      (0x1UL << 2)                            /**< Clock Edge for Setup/Sample                 */
#define _EUSART_CFG2_CLKPHA_SHIFT               2                                       /**< Shift value for EUSART_CLKPHA               */
#define _EUSART_CFG2_CLKPHA_MASK                0x4UL                                   /**< Bit mask for EUSART_CLKPHA                  */
#define _EUSART_CFG2_CLKPHA_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for EUSART_CFG2                */
#define _EUSART_CFG2_CLKPHA_SAMPLELEADING       0x00000000UL                            /**< Mode SAMPLELEADING for EUSART_CFG2          */
#define _EUSART_CFG2_CLKPHA_SAMPLETRAILING      0x00000001UL                            /**< Mode SAMPLETRAILING for EUSART_CFG2         */
#define EUSART_CFG2_CLKPHA_DEFAULT              (_EUSART_CFG2_CLKPHA_DEFAULT << 2)      /**< Shifted mode DEFAULT for EUSART_CFG2        */
#define EUSART_CFG2_CLKPHA_SAMPLELEADING        (_EUSART_CFG2_CLKPHA_SAMPLELEADING << 2) /**< Shifted mode SAMPLELEADING for EUSART_CFG2  */
#define EUSART_CFG2_CLKPHA_SAMPLETRAILING       (_EUSART_CFG2_CLKPHA_SAMPLETRAILING << 2) /**< Shifted mode SAMPLETRAILING for EUSART_CFG2 */
#define EUSART_CFG2_CSINV                       (0x1UL << 3)                            /**< Chip Select Invert                          */
#define _EUSART_CFG2_CSINV_SHIFT                3                                       /**< Shift value for EUSART_CSINV                */
#define _EUSART_CFG2_CSINV_MASK                 0x8UL                                   /**< Bit mask for EUSART_CSINV                   */
#define _EUSART_CFG2_CSINV_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for EUSART_CFG2                */
#define _EUSART_CFG2_CSINV_AL                   0x00000000UL                            /**< Mode AL for EUSART_CFG2                     */
#define _EUSART_CFG2_CSINV_AH                   0x00000001UL                            /**< Mode AH for EUSART_CFG2                     */
#define EUSART_CFG2_CSINV_DEFAULT               (_EUSART_CFG2_CSINV_DEFAULT << 3)       /**< Shifted mode DEFAULT for EUSART_CFG2        */
#define EUSART_CFG2_CSINV_AL                    (_EUSART_CFG2_CSINV_AL << 3)            /**< Shifted mode AL for EUSART_CFG2             */
#define EUSART_CFG2_CSINV_AH                    (_EUSART_CFG2_CSINV_AH << 3)            /**< Shifted mode AH for EUSART_CFG2             */
#define EUSART_CFG2_AUTOTX                      (0x1UL << 4)                            /**< Always Transmit When RXFIFO Not Full        */
#define _EUSART_CFG2_AUTOTX_SHIFT               4                                       /**< Shift value for EUSART_AUTOTX               */
#define _EUSART_CFG2_AUTOTX_MASK                0x10UL                                  /**< Bit mask for EUSART_AUTOTX                  */
#define _EUSART_CFG2_AUTOTX_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for EUSART_CFG2                */
#define EUSART_CFG2_AUTOTX_DEFAULT              (_EUSART_CFG2_AUTOTX_DEFAULT << 4)      /**< Shifted mode DEFAULT for EUSART_CFG2        */
#define EUSART_CFG2_AUTOCS                      (0x1UL << 5)                            /**< Automatic Chip Select                       */
#define _EUSART_CFG2_AUTOCS_SHIFT               5                                       /**< Shift value for EUSART_AUTOCS               */
#define _EUSART_CFG2_AUTOCS_MASK                0x20UL                                  /**< Bit mask for EUSART_AUTOCS                  */
#define _EUSART_CFG2_AUTOCS_DEFAULT             0x00000001UL                            /**< Mode DEFAULT for EUSART_CFG2                */
#define EUSART_CFG2_AUTOCS_DEFAULT              (_EUSART_CFG2_AUTOCS_DEFAULT << 5)      /**< Shifted mode DEFAULT for EUSART_CFG2        */
#define EUSART_CFG2_CLKPRSEN                    (0x1UL << 6)                            /**< PRS CLK Enable                              */
#define _EUSART_CFG2_CLKPRSEN_SHIFT             6                                       /**< Shift value for EUSART_CLKPRSEN             */
#define _EUSART_CFG2_CLKPRSEN_MASK              0x40UL                                  /**< Bit mask for EUSART_CLKPRSEN                */
#define _EUSART_CFG2_CLKPRSEN_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for EUSART_CFG2                */
#define EUSART_CFG2_CLKPRSEN_DEFAULT            (_EUSART_CFG2_CLKPRSEN_DEFAULT << 6)    /**< Shifted mode DEFAULT for EUSART_CFG2        */
#define EUSART_CFG2_FORCELOAD                   (0x1UL << 7)                            /**< Force Load to Shift Register                */
#define _EUSART_CFG2_FORCELOAD_SHIFT            7                                       /**< Shift value for EUSART_FORCELOAD            */
#define _EUSART_CFG2_FORCELOAD_MASK             0x80UL                                  /**< Bit mask for EUSART_FORCELOAD               */
#define _EUSART_CFG2_FORCELOAD_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for EUSART_CFG2                */
#define EUSART_CFG2_FORCELOAD_DEFAULT           (_EUSART_CFG2_FORCELOAD_DEFAULT << 7)   /**< Shifted mode DEFAULT for EUSART_CFG2        */
#define _EUSART_CFG2_SDIV_SHIFT                 24                                      /**< Shift value for EUSART_SDIV                 */
#define _EUSART_CFG2_SDIV_MASK                  0xFF000000UL                            /**< Bit mask for EUSART_SDIV                    */
#define _EUSART_CFG2_SDIV_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for EUSART_CFG2                */
#define EUSART_CFG2_SDIV_DEFAULT                (_EUSART_CFG2_SDIV_DEFAULT << 24)       /**< Shifted mode DEFAULT for EUSART_CFG2        */

/* Bit fields for EUSART FRAMECFG */
#define _EUSART_FRAMECFG_RESETVALUE             0x00001002UL                            /**< Default value for EUSART_FRAMECFG           */
#define _EUSART_FRAMECFG_MASK                   0x0000330FUL                            /**< Mask for EUSART_FRAMECFG                    */
#define _EUSART_FRAMECFG_DATABITS_SHIFT         0                                       /**< Shift value for EUSART_DATABITS             */
#define _EUSART_FRAMECFG_DATABITS_MASK          0xFUL                                   /**< Bit mask for EUSART_DATABITS                */
#define _EUSART_FRAMECFG_DATABITS_DEFAULT       0x00000002UL                            /**< Mode DEFAULT for EUSART_FRAMECFG            */
#define _EUSART_FRAMECFG_DATABITS_SEVEN         0x00000001UL                            /**< Mode SEVEN for EUSART_FRAMECFG              */
#define _EUSART_FRAMECFG_DATABITS_EIGHT         0x00000002UL                            /**< Mode EIGHT for EUSART_FRAMECFG              */
#define _EUSART_FRAMECFG_DATABITS_NINE          0x00000003UL                            /**< Mode NINE for EUSART_FRAMECFG               */
#define _EUSART_FRAMECFG_DATABITS_TEN           0x00000004UL                            /**< Mode TEN for EUSART_FRAMECFG                */
#define _EUSART_FRAMECFG_DATABITS_ELEVEN        0x00000005UL                            /**< Mode ELEVEN for EUSART_FRAMECFG             */
#define _EUSART_FRAMECFG_DATABITS_TWELVE        0x00000006UL                            /**< Mode TWELVE for EUSART_FRAMECFG             */
#define _EUSART_FRAMECFG_DATABITS_THIRTEEN      0x00000007UL                            /**< Mode THIRTEEN for EUSART_FRAMECFG           */
#define _EUSART_FRAMECFG_DATABITS_FOURTEEN      0x00000008UL                            /**< Mode FOURTEEN for EUSART_FRAMECFG           */
#define _EUSART_FRAMECFG_DATABITS_FIFTEEN       0x00000009UL                            /**< Mode FIFTEEN for EUSART_FRAMECFG            */
#define _EUSART_FRAMECFG_DATABITS_SIXTEEN       0x0000000AUL                            /**< Mode SIXTEEN for EUSART_FRAMECFG            */
#define EUSART_FRAMECFG_DATABITS_DEFAULT        (_EUSART_FRAMECFG_DATABITS_DEFAULT << 0) /**< Shifted mode DEFAULT for EUSART_FRAMECFG    */
#define EUSART_FRAMECFG_DATABITS_SEVEN          (_EUSART_FRAMECFG_DATABITS_SEVEN << 0)  /**< Shifted mode SEVEN for EUSART_FRAMECFG      */
#define EUSART_FRAMECFG_DATABITS_EIGHT          (_EUSART_FRAMECFG_DATABITS_EIGHT << 0)  /**< Shifted mode EIGHT for EUSART_FRAMECFG      */
#define EUSART_FRAMECFG_DATABITS_NINE           (_EUSART_FRAMECFG_DATABITS_NINE << 0)   /**< Shifted mode NINE for EUSART_FRAMECFG       */
#define EUSART_FRAMECFG_DATABITS_TEN            (_EUSART_FRAMECFG_DATABITS_TEN << 0)    /**< Shifted mode TEN for EUSART_FRAMECFG        */
#define EUSART_FRAMECFG_DATABITS_ELEVEN         (_EUSART_FRAMECFG_DATABITS_ELEVEN << 0) /**< Shifted mode ELEVEN for EUSART_FRAMECFG     */
#define EUSART_FRAMECFG_DATABITS_TWELVE         (_EUSART_FRAMECFG_DATABITS_TWELVE << 0) /**< Shifted mode TWELVE for EUSART_FRAMECFG     */
#define EUSART_FRAMECFG_DATABITS_THIRTEEN       (_EUSART_FRAMECFG_DATABITS_THIRTEEN << 0) /**< Shifted mode THIRTEEN for EUSART_FRAMECFG   */
#define EUSART_FRAMECFG_DATABITS_FOURTEEN       (_EUSART_FRAMECFG_DATABITS_FOURTEEN << 0) /**< Shifted mode FOURTEEN for EUSART_FRAMECFG   */
#define EUSART_FRAMECFG_DATABITS_FIFTEEN        (_EUSART_FRAMECFG_DATABITS_FIFTEEN << 0) /**< Shifted mode FIFTEEN for EUSART_FRAMECFG    */
#define EUSART_FRAMECFG_DATABITS_SIXTEEN        (_EUSART_FRAMECFG_DATABITS_SIXTEEN << 0) /**< Shifted mode SIXTEEN for EUSART_FRAMECFG    */
#define _EUSART_FRAMECFG_PARITY_SHIFT           8                                       /**< Shift value for EUSART_PARITY               */
#define _EUSART_FRAMECFG_PARITY_MASK            0x300UL                                 /**< Bit mask for EUSART_PARITY                  */
#define _EUSART_FRAMECFG_PARITY_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for EUSART_FRAMECFG            */
#define _EUSART_FRAMECFG_PARITY_NONE            0x00000000UL                            /**< Mode NONE for EUSART_FRAMECFG               */
#define _EUSART_FRAMECFG_PARITY_EVEN            0x00000002UL                            /**< Mode EVEN for EUSART_FRAMECFG               */
#define _EUSART_FRAMECFG_PARITY_ODD             0x00000003UL                            /**< Mode ODD for EUSART_FRAMECFG                */
#define EUSART_FRAMECFG_PARITY_DEFAULT          (_EUSART_FRAMECFG_PARITY_DEFAULT << 8)  /**< Shifted mode DEFAULT for EUSART_FRAMECFG    */
#define EUSART_FRAMECFG_PARITY_NONE             (_EUSART_FRAMECFG_PARITY_NONE << 8)     /**< Shifted mode NONE for EUSART_FRAMECFG       */
#define EUSART_FRAMECFG_PARITY_EVEN             (_EUSART_FRAMECFG_PARITY_EVEN << 8)     /**< Shifted mode EVEN for EUSART_FRAMECFG       */
#define EUSART_FRAMECFG_PARITY_ODD              (_EUSART_FRAMECFG_PARITY_ODD << 8)      /**< Shifted mode ODD for EUSART_FRAMECFG        */
#define _EUSART_FRAMECFG_STOPBITS_SHIFT         12                                      /**< Shift value for EUSART_STOPBITS             */
#define _EUSART_FRAMECFG_STOPBITS_MASK          0x3000UL                                /**< Bit mask for EUSART_STOPBITS                */
#define _EUSART_FRAMECFG_STOPBITS_DEFAULT       0x00000001UL                            /**< Mode DEFAULT for EUSART_FRAMECFG            */
#define _EUSART_FRAMECFG_STOPBITS_HALF          0x00000000UL                            /**< Mode HALF for EUSART_FRAMECFG               */
#define _EUSART_FRAMECFG_STOPBITS_ONE           0x00000001UL                            /**< Mode ONE for EUSART_FRAMECFG                */
#define _EUSART_FRAMECFG_STOPBITS_ONEANDAHALF   0x00000002UL                            /**< Mode ONEANDAHALF for EUSART_FRAMECFG        */
#define _EUSART_FRAMECFG_STOPBITS_TWO           0x00000003UL                            /**< Mode TWO for EUSART_FRAMECFG                */
#define EUSART_FRAMECFG_STOPBITS_DEFAULT        (_EUSART_FRAMECFG_STOPBITS_DEFAULT << 12) /**< Shifted mode DEFAULT for EUSART_FRAMECFG    */
#define EUSART_FRAMECFG_STOPBITS_HALF           (_EUSART_FRAMECFG_STOPBITS_HALF << 12)  /**< Shifted mode HALF for EUSART_FRAMECFG       */
#define EUSART_FRAMECFG_STOPBITS_ONE            (_EUSART_FRAMECFG_STOPBITS_ONE << 12)   /**< Shifted mode ONE for EUSART_FRAMECFG        */
#define EUSART_FRAMECFG_STOPBITS_ONEANDAHALF    (_EUSART_FRAMECFG_STOPBITS_ONEANDAHALF << 12) /**< Shifted mode ONEANDAHALF for EUSART_FRAMECFG*/
#define EUSART_FRAMECFG_STOPBITS_TWO            (_EUSART_FRAMECFG_STOPBITS_TWO << 12)   /**< Shifted mode TWO for EUSART_FRAMECFG        */

/* Bit fields for EUSART DTXDATCFG */
#define _EUSART_DTXDATCFG_RESETVALUE            0x00000000UL                            /**< Default value for EUSART_DTXDATCFG          */
#define _EUSART_DTXDATCFG_MASK                  0x0000FFFFUL                            /**< Mask for EUSART_DTXDATCFG                   */
#define _EUSART_DTXDATCFG_DTXDAT_SHIFT          0                                       /**< Shift value for EUSART_DTXDAT               */
#define _EUSART_DTXDATCFG_DTXDAT_MASK           0xFFFFUL                                /**< Bit mask for EUSART_DTXDAT                  */
#define _EUSART_DTXDATCFG_DTXDAT_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for EUSART_DTXDATCFG           */
#define EUSART_DTXDATCFG_DTXDAT_DEFAULT         (_EUSART_DTXDATCFG_DTXDAT_DEFAULT << 0) /**< Shifted mode DEFAULT for EUSART_DTXDATCFG   */

/* Bit fields for EUSART IRHFCFG */
#define _EUSART_IRHFCFG_RESETVALUE              0x00000000UL                            /**< Default value for EUSART_IRHFCFG            */
#define _EUSART_IRHFCFG_MASK                    0x0000000FUL                            /**< Mask for EUSART_IRHFCFG                     */
#define EUSART_IRHFCFG_IRHFEN                   (0x1UL << 0)                            /**< Enable IrDA Module                          */
#define _EUSART_IRHFCFG_IRHFEN_SHIFT            0                                       /**< Shift value for EUSART_IRHFEN               */
#define _EUSART_IRHFCFG_IRHFEN_MASK             0x1UL                                   /**< Bit mask for EUSART_IRHFEN                  */
#define _EUSART_IRHFCFG_IRHFEN_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for EUSART_IRHFCFG             */
#define EUSART_IRHFCFG_IRHFEN_DEFAULT           (_EUSART_IRHFCFG_IRHFEN_DEFAULT << 0)   /**< Shifted mode DEFAULT for EUSART_IRHFCFG     */
#define _EUSART_IRHFCFG_IRHFPW_SHIFT            1                                       /**< Shift value for EUSART_IRHFPW               */
#define _EUSART_IRHFCFG_IRHFPW_MASK             0x6UL                                   /**< Bit mask for EUSART_IRHFPW                  */
#define _EUSART_IRHFCFG_IRHFPW_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for EUSART_IRHFCFG             */
#define _EUSART_IRHFCFG_IRHFPW_ONE              0x00000000UL                            /**< Mode ONE for EUSART_IRHFCFG                 */
#define _EUSART_IRHFCFG_IRHFPW_TWO              0x00000001UL                            /**< Mode TWO for EUSART_IRHFCFG                 */
#define _EUSART_IRHFCFG_IRHFPW_THREE            0x00000002UL                            /**< Mode THREE for EUSART_IRHFCFG               */
#define _EUSART_IRHFCFG_IRHFPW_FOUR             0x00000003UL                            /**< Mode FOUR for EUSART_IRHFCFG                */
#define EUSART_IRHFCFG_IRHFPW_DEFAULT           (_EUSART_IRHFCFG_IRHFPW_DEFAULT << 1)   /**< Shifted mode DEFAULT for EUSART_IRHFCFG     */
#define EUSART_IRHFCFG_IRHFPW_ONE               (_EUSART_IRHFCFG_IRHFPW_ONE << 1)       /**< Shifted mode ONE for EUSART_IRHFCFG         */
#define EUSART_IRHFCFG_IRHFPW_TWO               (_EUSART_IRHFCFG_IRHFPW_TWO << 1)       /**< Shifted mode TWO for EUSART_IRHFCFG         */
#define EUSART_IRHFCFG_IRHFPW_THREE             (_EUSART_IRHFCFG_IRHFPW_THREE << 1)     /**< Shifted mode THREE for EUSART_IRHFCFG       */
#define EUSART_IRHFCFG_IRHFPW_FOUR              (_EUSART_IRHFCFG_IRHFPW_FOUR << 1)      /**< Shifted mode FOUR for EUSART_IRHFCFG        */
#define EUSART_IRHFCFG_IRHFFILT                 (0x1UL << 3)                            /**< IrDA RX Filter                              */
#define _EUSART_IRHFCFG_IRHFFILT_SHIFT          3                                       /**< Shift value for EUSART_IRHFFILT             */
#define _EUSART_IRHFCFG_IRHFFILT_MASK           0x8UL                                   /**< Bit mask for EUSART_IRHFFILT                */
#define _EUSART_IRHFCFG_IRHFFILT_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for EUSART_IRHFCFG             */
#define _EUSART_IRHFCFG_IRHFFILT_DISABLE        0x00000000UL                            /**< Mode DISABLE for EUSART_IRHFCFG             */
#define _EUSART_IRHFCFG_IRHFFILT_ENABLE         0x00000001UL                            /**< Mode ENABLE for EUSART_IRHFCFG              */
#define EUSART_IRHFCFG_IRHFFILT_DEFAULT         (_EUSART_IRHFCFG_IRHFFILT_DEFAULT << 3) /**< Shifted mode DEFAULT for EUSART_IRHFCFG     */
#define EUSART_IRHFCFG_IRHFFILT_DISABLE         (_EUSART_IRHFCFG_IRHFFILT_DISABLE << 3) /**< Shifted mode DISABLE for EUSART_IRHFCFG     */
#define EUSART_IRHFCFG_IRHFFILT_ENABLE          (_EUSART_IRHFCFG_IRHFFILT_ENABLE << 3)  /**< Shifted mode ENABLE for EUSART_IRHFCFG      */

/* Bit fields for EUSART IRLFCFG */
#define _EUSART_IRLFCFG_RESETVALUE              0x00000000UL                            /**< Default value for EUSART_IRLFCFG            */
#define _EUSART_IRLFCFG_MASK                    0x00000001UL                            /**< Mask for EUSART_IRLFCFG                     */
#define EUSART_IRLFCFG_IRLFEN                   (0x1UL << 0)                            /**< Pulse Generator/Extender Enable             */
#define _EUSART_IRLFCFG_IRLFEN_SHIFT            0                                       /**< Shift value for EUSART_IRLFEN               */
#define _EUSART_IRLFCFG_IRLFEN_MASK             0x1UL                                   /**< Bit mask for EUSART_IRLFEN                  */
#define _EUSART_IRLFCFG_IRLFEN_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for EUSART_IRLFCFG             */
#define EUSART_IRLFCFG_IRLFEN_DEFAULT           (_EUSART_IRLFCFG_IRLFEN_DEFAULT << 0)   /**< Shifted mode DEFAULT for EUSART_IRLFCFG     */

