SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_eusart.h
/* Bit fields for EUSART TIMINGCFG */
#define _EUSART_TIMINGCFG_RESETVALUE            0x00050000UL                            /**< Default value for EUSART_TIMINGCFG          */
#define _EUSART_TIMINGCFG_MASK                  0x000F7773UL                            /**< Mask for EUSART_TIMINGCFG                   */
#define _EUSART_TIMINGCFG_TXDELAY_SHIFT         0                                       /**< Shift value for EUSART_TXDELAY              */
#define _EUSART_TIMINGCFG_TXDELAY_MASK          0x3UL                                   /**< Bit mask for EUSART_TXDELAY                 */
#define _EUSART_TIMINGCFG_TXDELAY_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for EUSART_TIMINGCFG           */
#define _EUSART_TIMINGCFG_TXDELAY_NONE          0x00000000UL                            /**< Mode NONE for EUSART_TIMINGCFG              */
#define _EUSART_TIMINGCFG_TXDELAY_SINGLE        0x00000001UL                            /**< Mode SINGLE for EUSART_TIMINGCFG            */
#define _EUSART_TIMINGCFG_TXDELAY_DOUBLE        0x00000002UL                            /**< Mode DOUBLE for EUSART_TIMINGCFG            */
#define _EUSART_TIMINGCFG_TXDELAY_TRIPPLE       0x00000003UL                            /**< Mode TRIPPLE for EUSART_TIMINGCFG           */
#define EUSART_TIMINGCFG_TXDELAY_DEFAULT        (_EUSART_TIMINGCFG_TXDELAY_DEFAULT << 0) /**< Shifted mode DEFAULT for EUSART_TIMINGCFG   */
#define EUSART_TIMINGCFG_TXDELAY_NONE           (_EUSART_TIMINGCFG_TXDELAY_NONE << 0)   /**< Shifted mode NONE for EUSART_TIMINGCFG      */
#define EUSART_TIMINGCFG_TXDELAY_SINGLE         (_EUSART_TIMINGCFG_TXDELAY_SINGLE << 0) /**< Shifted mode SINGLE for EUSART_TIMINGCFG    */
#define EUSART_TIMINGCFG_TXDELAY_DOUBLE         (_EUSART_TIMINGCFG_TXDELAY_DOUBLE << 0) /**< Shifted mode DOUBLE for EUSART_TIMINGCFG    */
#define EUSART_TIMINGCFG_TXDELAY_TRIPPLE        (_EUSART_TIMINGCFG_TXDELAY_TRIPPLE << 0) /**< Shifted mode TRIPPLE for EUSART_TIMINGCFG   */
#define _EUSART_TIMINGCFG_CSSETUP_SHIFT         4                                       /**< Shift value for EUSART_CSSETUP              */
#define _EUSART_TIMINGCFG_CSSETUP_MASK          0x70UL                                  /**< Bit mask for EUSART_CSSETUP                 */
#define _EUSART_TIMINGCFG_CSSETUP_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for EUSART_TIMINGCFG           */
#define _EUSART_TIMINGCFG_CSSETUP_ZERO          0x00000000UL                            /**< Mode ZERO for EUSART_TIMINGCFG              */
#define _EUSART_TIMINGCFG_CSSETUP_ONE           0x00000001UL                            /**< Mode ONE for EUSART_TIMINGCFG               */
#define _EUSART_TIMINGCFG_CSSETUP_TWO           0x00000002UL                            /**< Mode TWO for EUSART_TIMINGCFG               */
#define _EUSART_TIMINGCFG_CSSETUP_THREE         0x00000003UL                            /**< Mode THREE for EUSART_TIMINGCFG             */
#define _EUSART_TIMINGCFG_CSSETUP_FOUR          0x00000004UL                            /**< Mode FOUR for EUSART_TIMINGCFG              */
#define _EUSART_TIMINGCFG_CSSETUP_FIVE          0x00000005UL                            /**< Mode FIVE for EUSART_TIMINGCFG              */
#define _EUSART_TIMINGCFG_CSSETUP_SIX           0x00000006UL                            /**< Mode SIX for EUSART_TIMINGCFG               */
#define _EUSART_TIMINGCFG_CSSETUP_SEVEN         0x00000007UL                            /**< Mode SEVEN for EUSART_TIMINGCFG             */
#define EUSART_TIMINGCFG_CSSETUP_DEFAULT        (_EUSART_TIMINGCFG_CSSETUP_DEFAULT << 4) /**< Shifted mode DEFAULT for EUSART_TIMINGCFG   */
#define EUSART_TIMINGCFG_CSSETUP_ZERO           (_EUSART_TIMINGCFG_CSSETUP_ZERO << 4)   /**< Shifted mode ZERO for EUSART_TIMINGCFG      */
#define EUSART_TIMINGCFG_CSSETUP_ONE            (_EUSART_TIMINGCFG_CSSETUP_ONE << 4)    /**< Shifted mode ONE for EUSART_TIMINGCFG       */
#define EUSART_TIMINGCFG_CSSETUP_TWO            (_EUSART_TIMINGCFG_CSSETUP_TWO << 4)    /**< Shifted mode TWO for EUSART_TIMINGCFG       */
#define EUSART_TIMINGCFG_CSSETUP_THREE          (_EUSART_TIMINGCFG_CSSETUP_THREE << 4)  /**< Shifted mode THREE for EUSART_TIMINGCFG     */
#define EUSART_TIMINGCFG_CSSETUP_FOUR           (_EUSART_TIMINGCFG_CSSETUP_FOUR << 4)   /**< Shifted mode FOUR for EUSART_TIMINGCFG      */
#define EUSART_TIMINGCFG_CSSETUP_FIVE           (_EUSART_TIMINGCFG_CSSETUP_FIVE << 4)   /**< Shifted mode FIVE for EUSART_TIMINGCFG      */
#define EUSART_TIMINGCFG_CSSETUP_SIX            (_EUSART_TIMINGCFG_CSSETUP_SIX << 4)    /**< Shifted mode SIX for EUSART_TIMINGCFG       */
#define EUSART_TIMINGCFG_CSSETUP_SEVEN          (_EUSART_TIMINGCFG_CSSETUP_SEVEN << 4)  /**< Shifted mode SEVEN for EUSART_TIMINGCFG     */
#define _EUSART_TIMINGCFG_CSHOLD_SHIFT          8                                       /**< Shift value for EUSART_CSHOLD               */
#define _EUSART_TIMINGCFG_CSHOLD_MASK           0x700UL                                 /**< Bit mask for EUSART_CSHOLD                  */
#define _EUSART_TIMINGCFG_CSHOLD_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for EUSART_TIMINGCFG           */
#define _EUSART_TIMINGCFG_CSHOLD_ZERO           0x00000000UL                            /**< Mode ZERO for EUSART_TIMINGCFG              */
#define _EUSART_TIMINGCFG_CSHOLD_ONE            0x00000001UL                            /**< Mode ONE for EUSART_TIMINGCFG               */
#define _EUSART_TIMINGCFG_CSHOLD_TWO            0x00000002UL                            /**< Mode TWO for EUSART_TIMINGCFG               */
#define _EUSART_TIMINGCFG_CSHOLD_THREE          0x00000003UL                            /**< Mode THREE for EUSART_TIMINGCFG             */
#define _EUSART_TIMINGCFG_CSHOLD_FOUR           0x00000004UL                            /**< Mode FOUR for EUSART_TIMINGCFG              */
#define _EUSART_TIMINGCFG_CSHOLD_FIVE           0x00000005UL                            /**< Mode FIVE for EUSART_TIMINGCFG              */
#define _EUSART_TIMINGCFG_CSHOLD_SIX            0x00000006UL                            /**< Mode SIX for EUSART_TIMINGCFG               */
#define _EUSART_TIMINGCFG_CSHOLD_SEVEN          0x00000007UL                            /**< Mode SEVEN for EUSART_TIMINGCFG             */
#define EUSART_TIMINGCFG_CSHOLD_DEFAULT         (_EUSART_TIMINGCFG_CSHOLD_DEFAULT << 8) /**< Shifted mode DEFAULT for EUSART_TIMINGCFG   */
#define EUSART_TIMINGCFG_CSHOLD_ZERO            (_EUSART_TIMINGCFG_CSHOLD_ZERO << 8)    /**< Shifted mode ZERO for EUSART_TIMINGCFG      */
#define EUSART_TIMINGCFG_CSHOLD_ONE             (_EUSART_TIMINGCFG_CSHOLD_ONE << 8)     /**< Shifted mode ONE for EUSART_TIMINGCFG       */
#define EUSART_TIMINGCFG_CSHOLD_TWO             (_EUSART_TIMINGCFG_CSHOLD_TWO << 8)     /**< Shifted mode TWO for EUSART_TIMINGCFG       */
#define EUSART_TIMINGCFG_CSHOLD_THREE           (_EUSART_TIMINGCFG_CSHOLD_THREE << 8)   /**< Shifted mode THREE for EUSART_TIMINGCFG     */
#define EUSART_TIMINGCFG_CSHOLD_FOUR            (_EUSART_TIMINGCFG_CSHOLD_FOUR << 8)    /**< Shifted mode FOUR for EUSART_TIMINGCFG      */
#define EUSART_TIMINGCFG_CSHOLD_FIVE            (_EUSART_TIMINGCFG_CSHOLD_FIVE << 8)    /**< Shifted mode FIVE for EUSART_TIMINGCFG      */
#define EUSART_TIMINGCFG_CSHOLD_SIX             (_EUSART_TIMINGCFG_CSHOLD_SIX << 8)     /**< Shifted mode SIX for EUSART_TIMINGCFG       */
#define EUSART_TIMINGCFG_CSHOLD_SEVEN           (_EUSART_TIMINGCFG_CSHOLD_SEVEN << 8)   /**< Shifted mode SEVEN for EUSART_TIMINGCFG     */
#define _EUSART_TIMINGCFG_ICS_SHIFT             12                                      /**< Shift value for EUSART_ICS                  */
#define _EUSART_TIMINGCFG_ICS_MASK              0x7000UL                                /**< Bit mask for EUSART_ICS                     */
#define _EUSART_TIMINGCFG_ICS_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for EUSART_TIMINGCFG           */
#define _EUSART_TIMINGCFG_ICS_ZERO              0x00000000UL                            /**< Mode ZERO for EUSART_TIMINGCFG              */
#define _EUSART_TIMINGCFG_ICS_ONE               0x00000001UL                            /**< Mode ONE for EUSART_TIMINGCFG               */
#define _EUSART_TIMINGCFG_ICS_TWO               0x00000002UL                            /**< Mode TWO for EUSART_TIMINGCFG               */
#define _EUSART_TIMINGCFG_ICS_THREE             0x00000003UL                            /**< Mode THREE for EUSART_TIMINGCFG             */
#define _EUSART_TIMINGCFG_ICS_FOUR              0x00000004UL                            /**< Mode FOUR for EUSART_TIMINGCFG              */
#define _EUSART_TIMINGCFG_ICS_FIVE              0x00000005UL                            /**< Mode FIVE for EUSART_TIMINGCFG              */
#define _EUSART_TIMINGCFG_ICS_SIX               0x00000006UL                            /**< Mode SIX for EUSART_TIMINGCFG               */
#define _EUSART_TIMINGCFG_ICS_SEVEN             0x00000007UL                            /**< Mode SEVEN for EUSART_TIMINGCFG             */
#define EUSART_TIMINGCFG_ICS_DEFAULT            (_EUSART_TIMINGCFG_ICS_DEFAULT << 12)   /**< Shifted mode DEFAULT for EUSART_TIMINGCFG   */
#define EUSART_TIMINGCFG_ICS_ZERO               (_EUSART_TIMINGCFG_ICS_ZERO << 12)      /**< Shifted mode ZERO for EUSART_TIMINGCFG      */
#define EUSART_TIMINGCFG_ICS_ONE                (_EUSART_TIMINGCFG_ICS_ONE << 12)       /**< Shifted mode ONE for EUSART_TIMINGCFG       */
#define EUSART_TIMINGCFG_ICS_TWO                (_EUSART_TIMINGCFG_ICS_TWO << 12)       /**< Shifted mode TWO for EUSART_TIMINGCFG       */
#define EUSART_TIMINGCFG_ICS_THREE              (_EUSART_TIMINGCFG_ICS_THREE << 12)     /**< Shifted mode THREE for EUSART_TIMINGCFG     */
#define EUSART_TIMINGCFG_ICS_FOUR               (_EUSART_TIMINGCFG_ICS_FOUR << 12)      /**< Shifted mode FOUR for EUSART_TIMINGCFG      */
#define EUSART_TIMINGCFG_ICS_FIVE               (_EUSART_TIMINGCFG_ICS_FIVE << 12)      /**< Shifted mode FIVE for EUSART_TIMINGCFG      */
#define EUSART_TIMINGCFG_ICS_SIX                (_EUSART_TIMINGCFG_ICS_SIX << 12)       /**< Shifted mode SIX for EUSART_TIMINGCFG       */
#define EUSART_TIMINGCFG_ICS_SEVEN              (_EUSART_TIMINGCFG_ICS_SEVEN << 12)     /**< Shifted mode SEVEN for EUSART_TIMINGCFG     */
#define _EUSART_TIMINGCFG_SETUPWINDOW_SHIFT     16                                      /**< Shift value for EUSART_SETUPWINDOW          */
#define _EUSART_TIMINGCFG_SETUPWINDOW_MASK      0xF0000UL                               /**< Bit mask for EUSART_SETUPWINDOW             */
#define _EUSART_TIMINGCFG_SETUPWINDOW_DEFAULT   0x00000005UL                            /**< Mode DEFAULT for EUSART_TIMINGCFG           */
#define EUSART_TIMINGCFG_SETUPWINDOW_DEFAULT    (_EUSART_TIMINGCFG_SETUPWINDOW_DEFAULT << 16) /**< Shifted mode DEFAULT for EUSART_TIMINGCFG   */

/* Bit fields for EUSART STARTFRAMECFG */
#define _EUSART_STARTFRAMECFG_RESETVALUE        0x00000000UL                            /**< Default value for EUSART_STARTFRAMECFG      */
#define _EUSART_STARTFRAMECFG_MASK              0x000001FFUL                            /**< Mask for EUSART_STARTFRAMECFG               */
#define _EUSART_STARTFRAMECFG_STARTFRAME_SHIFT  0                                       /**< Shift value for EUSART_STARTFRAME           */
#define _EUSART_STARTFRAMECFG_STARTFRAME_MASK   0x1FFUL                                 /**< Bit mask for EUSART_STARTFRAME              */
#define _EUSART_STARTFRAMECFG_STARTFRAME_DEFAULT 0x00000000UL                            /**< Mode DEFAULT for EUSART_STARTFRAMECFG       */
#define EUSART_STARTFRAMECFG_STARTFRAME_DEFAULT (_EUSART_STARTFRAMECFG_STARTFRAME_DEFAULT << 0) /**< Shifted mode DEFAULT for EUSART_STARTFRAMECFG*/

