SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_eusart.h
/* Bit fields for EUSART SIGFRAMECFG */
#define _EUSART_SIGFRAMECFG_RESETVALUE          0x00000000UL                            /**< Default value for EUSART_SIGFRAMECFG        */
#define _EUSART_SIGFRAMECFG_MASK                0x000001FFUL                            /**< Mask for EUSART_SIGFRAMECFG                 */
#define _EUSART_SIGFRAMECFG_SIGFRAME_SHIFT      0                                       /**< Shift value for EUSART_SIGFRAME             */
#define _EUSART_SIGFRAMECFG_SIGFRAME_MASK       0x1FFUL                                 /**< Bit mask for EUSART_SIGFRAME                */
#define _EUSART_SIGFRAMECFG_SIGFRAME_DEFAULT    0x00000000UL                            /**< Mode DEFAULT for EUSART_SIGFRAMECFG         */
#define EUSART_SIGFRAMECFG_SIGFRAME_DEFAULT     (_EUSART_SIGFRAMECFG_SIGFRAME_DEFAULT << 0) /**< Shifted mode DEFAULT for EUSART_SIGFRAMECFG */

/* Bit fields for EUSART CLKDIV */
#define _EUSART_CLKDIV_RESETVALUE               0x00000000UL                            /**< Default value for EUSART_CLKDIV             */
#define _EUSART_CLKDIV_MASK                     0x007FFFF8UL                            /**< Mask for EUSART_CLKDIV                      */
#define _EUSART_CLKDIV_DIV_SHIFT                3                                       /**< Shift value for EUSART_DIV                  */
#define _EUSART_CLKDIV_DIV_MASK                 0x7FFFF8UL                              /**< Bit mask for EUSART_DIV                     */
#define _EUSART_CLKDIV_DIV_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for EUSART_CLKDIV              */
#define EUSART_CLKDIV_DIV_DEFAULT               (_EUSART_CLKDIV_DIV_DEFAULT << 3)       /**< Shifted mode DEFAULT for EUSART_CLKDIV      */

/* Bit fields for EUSART TRIGCTRL */
#define _EUSART_TRIGCTRL_RESETVALUE             0x00000000UL                            /**< Default value for EUSART_TRIGCTRL           */
#define _EUSART_TRIGCTRL_MASK                   0x00000007UL                            /**< Mask for EUSART_TRIGCTRL                    */
#define EUSART_TRIGCTRL_RXTEN                   (0x1UL << 0)                            /**< Receive Trigger Enable                      */
#define _EUSART_TRIGCTRL_RXTEN_SHIFT            0                                       /**< Shift value for EUSART_RXTEN                */
#define _EUSART_TRIGCTRL_RXTEN_MASK             0x1UL                                   /**< Bit mask for EUSART_RXTEN                   */
#define _EUSART_TRIGCTRL_RXTEN_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for EUSART_TRIGCTRL            */
#define EUSART_TRIGCTRL_RXTEN_DEFAULT           (_EUSART_TRIGCTRL_RXTEN_DEFAULT << 0)   /**< Shifted mode DEFAULT for EUSART_TRIGCTRL    */
#define EUSART_TRIGCTRL_TXTEN                   (0x1UL << 1)                            /**< Transmit Trigger Enable                     */
#define _EUSART_TRIGCTRL_TXTEN_SHIFT            1                                       /**< Shift value for EUSART_TXTEN                */
#define _EUSART_TRIGCTRL_TXTEN_MASK             0x2UL                                   /**< Bit mask for EUSART_TXTEN                   */
#define _EUSART_TRIGCTRL_TXTEN_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for EUSART_TRIGCTRL            */
#define EUSART_TRIGCTRL_TXTEN_DEFAULT           (_EUSART_TRIGCTRL_TXTEN_DEFAULT << 1)   /**< Shifted mode DEFAULT for EUSART_TRIGCTRL    */
#define EUSART_TRIGCTRL_AUTOTXTEN               (0x1UL << 2)                            /**< AUTOTX Trigger Enable                       */
#define _EUSART_TRIGCTRL_AUTOTXTEN_SHIFT        2                                       /**< Shift value for EUSART_AUTOTXTEN            */
#define _EUSART_TRIGCTRL_AUTOTXTEN_MASK         0x4UL                                   /**< Bit mask for EUSART_AUTOTXTEN               */
#define _EUSART_TRIGCTRL_AUTOTXTEN_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for EUSART_TRIGCTRL            */
#define EUSART_TRIGCTRL_AUTOTXTEN_DEFAULT       (_EUSART_TRIGCTRL_AUTOTXTEN_DEFAULT << 2) /**< Shifted mode DEFAULT for EUSART_TRIGCTRL    */

/* Bit fields for EUSART CMD */
#define _EUSART_CMD_RESETVALUE                  0x00000000UL                            /**< Default value for EUSART_CMD                */
#define _EUSART_CMD_MASK                        0x000001FFUL                            /**< Mask for EUSART_CMD                         */
#define EUSART_CMD_RXEN                         (0x1UL << 0)                            /**< Receiver Enable                             */
#define _EUSART_CMD_RXEN_SHIFT                  0                                       /**< Shift value for EUSART_RXEN                 */
#define _EUSART_CMD_RXEN_MASK                   0x1UL                                   /**< Bit mask for EUSART_RXEN                    */
#define _EUSART_CMD_RXEN_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_RXEN_DEFAULT                 (_EUSART_CMD_RXEN_DEFAULT << 0)         /**< Shifted mode DEFAULT for EUSART_CMD         */
#define EUSART_CMD_RXDIS                        (0x1UL << 1)                            /**< Receiver Disable                            */
#define _EUSART_CMD_RXDIS_SHIFT                 1                                       /**< Shift value for EUSART_RXDIS                */
#define _EUSART_CMD_RXDIS_MASK                  0x2UL                                   /**< Bit mask for EUSART_RXDIS                   */
#define _EUSART_CMD_RXDIS_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_RXDIS_DEFAULT                (_EUSART_CMD_RXDIS_DEFAULT << 1)        /**< Shifted mode DEFAULT for EUSART_CMD         */
#define EUSART_CMD_TXEN                         (0x1UL << 2)                            /**< Transmitter Enable                          */
#define _EUSART_CMD_TXEN_SHIFT                  2                                       /**< Shift value for EUSART_TXEN                 */
#define _EUSART_CMD_TXEN_MASK                   0x4UL                                   /**< Bit mask for EUSART_TXEN                    */
#define _EUSART_CMD_TXEN_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_TXEN_DEFAULT                 (_EUSART_CMD_TXEN_DEFAULT << 2)         /**< Shifted mode DEFAULT for EUSART_CMD         */
#define EUSART_CMD_TXDIS                        (0x1UL << 3)                            /**< Transmitter Disable                         */
#define _EUSART_CMD_TXDIS_SHIFT                 3                                       /**< Shift value for EUSART_TXDIS                */
#define _EUSART_CMD_TXDIS_MASK                  0x8UL                                   /**< Bit mask for EUSART_TXDIS                   */
#define _EUSART_CMD_TXDIS_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_TXDIS_DEFAULT                (_EUSART_CMD_TXDIS_DEFAULT << 3)        /**< Shifted mode DEFAULT for EUSART_CMD         */
#define EUSART_CMD_RXBLOCKEN                    (0x1UL << 4)                            /**< Receiver Block Enable                       */
#define _EUSART_CMD_RXBLOCKEN_SHIFT             4                                       /**< Shift value for EUSART_RXBLOCKEN            */
#define _EUSART_CMD_RXBLOCKEN_MASK              0x10UL                                  /**< Bit mask for EUSART_RXBLOCKEN               */
#define _EUSART_CMD_RXBLOCKEN_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_RXBLOCKEN_DEFAULT            (_EUSART_CMD_RXBLOCKEN_DEFAULT << 4)    /**< Shifted mode DEFAULT for EUSART_CMD         */
#define EUSART_CMD_RXBLOCKDIS                   (0x1UL << 5)                            /**< Receiver Block Disable                      */
#define _EUSART_CMD_RXBLOCKDIS_SHIFT            5                                       /**< Shift value for EUSART_RXBLOCKDIS           */
#define _EUSART_CMD_RXBLOCKDIS_MASK             0x20UL                                  /**< Bit mask for EUSART_RXBLOCKDIS              */
#define _EUSART_CMD_RXBLOCKDIS_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_RXBLOCKDIS_DEFAULT           (_EUSART_CMD_RXBLOCKDIS_DEFAULT << 5)   /**< Shifted mode DEFAULT for EUSART_CMD         */
#define EUSART_CMD_TXTRIEN                      (0x1UL << 6)                            /**< Transmitter Tristate Enable                 */
#define _EUSART_CMD_TXTRIEN_SHIFT               6                                       /**< Shift value for EUSART_TXTRIEN              */
#define _EUSART_CMD_TXTRIEN_MASK                0x40UL                                  /**< Bit mask for EUSART_TXTRIEN                 */
#define _EUSART_CMD_TXTRIEN_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_TXTRIEN_DEFAULT              (_EUSART_CMD_TXTRIEN_DEFAULT << 6)      /**< Shifted mode DEFAULT for EUSART_CMD         */
#define EUSART_CMD_TXTRIDIS                     (0x1UL << 7)                            /**< Transmitter Tristate Disable                */
#define _EUSART_CMD_TXTRIDIS_SHIFT              7                                       /**< Shift value for EUSART_TXTRIDIS             */
#define _EUSART_CMD_TXTRIDIS_MASK               0x80UL                                  /**< Bit mask for EUSART_TXTRIDIS                */
#define _EUSART_CMD_TXTRIDIS_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_TXTRIDIS_DEFAULT             (_EUSART_CMD_TXTRIDIS_DEFAULT << 7)     /**< Shifted mode DEFAULT for EUSART_CMD         */
#define EUSART_CMD_CLEARTX                      (0x1UL << 8)                            /**< Clear TX FIFO                               */
#define _EUSART_CMD_CLEARTX_SHIFT               8                                       /**< Shift value for EUSART_CLEARTX              */
#define _EUSART_CMD_CLEARTX_MASK                0x100UL                                 /**< Bit mask for EUSART_CLEARTX                 */
#define _EUSART_CMD_CLEARTX_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for EUSART_CMD                 */
#define EUSART_CMD_CLEARTX_DEFAULT              (_EUSART_CMD_CLEARTX_DEFAULT << 8)      /**< Shifted mode DEFAULT for EUSART_CMD         */

/* Bit fields for EUSART RXDATA */
#define _EUSART_RXDATA_RESETVALUE               0x00000000UL                            /**< Default value for EUSART_RXDATA             */
#define _EUSART_RXDATA_MASK                     0x0000FFFFUL                            /**< Mask for EUSART_RXDATA                      */
#define _EUSART_RXDATA_RXDATA_SHIFT             0                                       /**< Shift value for EUSART_RXDATA               */
#define _EUSART_RXDATA_RXDATA_MASK              0xFFFFUL                                /**< Bit mask for EUSART_RXDATA                  */
#define _EUSART_RXDATA_RXDATA_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for EUSART_RXDATA              */
#define EUSART_RXDATA_RXDATA_DEFAULT            (_EUSART_RXDATA_RXDATA_DEFAULT << 0)    /**< Shifted mode DEFAULT for EUSART_RXDATA      */

/* Bit fields for EUSART RXDATAP */
#define _EUSART_RXDATAP_RESETVALUE              0x00000000UL                            /**< Default value for EUSART_RXDATAP            */
#define _EUSART_RXDATAP_MASK                    0x0000FFFFUL                            /**< Mask for EUSART_RXDATAP                     */
#define _EUSART_RXDATAP_RXDATAP_SHIFT           0                                       /**< Shift value for EUSART_RXDATAP              */
#define _EUSART_RXDATAP_RXDATAP_MASK            0xFFFFUL                                /**< Bit mask for EUSART_RXDATAP                 */
#define _EUSART_RXDATAP_RXDATAP_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for EUSART_RXDATAP             */
#define EUSART_RXDATAP_RXDATAP_DEFAULT          (_EUSART_RXDATAP_RXDATAP_DEFAULT << 0)  /**< Shifted mode DEFAULT for EUSART_RXDATAP     */

/* Bit fields for EUSART TXDATA */
#define _EUSART_TXDATA_RESETVALUE               0x00000000UL                            /**< Default value for EUSART_TXDATA             */
#define _EUSART_TXDATA_MASK                     0x0000FFFFUL                            /**< Mask for EUSART_TXDATA                      */
#define _EUSART_TXDATA_TXDATA_SHIFT             0                                       /**< Shift value for EUSART_TXDATA               */
#define _EUSART_TXDATA_TXDATA_MASK              0xFFFFUL                                /**< Bit mask for EUSART_TXDATA                  */
#define _EUSART_TXDATA_TXDATA_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for EUSART_TXDATA              */
#define EUSART_TXDATA_TXDATA_DEFAULT            (_EUSART_TXDATA_TXDATA_DEFAULT << 0)    /**< Shifted mode DEFAULT for EUSART_TXDATA      */

