SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_eusart.h
/* Bit fields for EUSART STATUS */
#define _EUSART_STATUS_RESETVALUE               0x00003040UL                            /**< Default value for EUSART_STATUS             */
#define _EUSART_STATUS_MASK                     0x031F31FBUL                            /**< Mask for EUSART_STATUS                      */
#define EUSART_STATUS_RXENS                     (0x1UL << 0)                            /**< Receiver Enable Status                      */
#define _EUSART_STATUS_RXENS_SHIFT              0                                       /**< Shift value for EUSART_RXENS                */
#define _EUSART_STATUS_RXENS_MASK               0x1UL                                   /**< Bit mask for EUSART_RXENS                   */
#define _EUSART_STATUS_RXENS_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for EUSART_STATUS              */
#define EUSART_STATUS_RXENS_DEFAULT             (_EUSART_STATUS_RXENS_DEFAULT << 0)     /**< Shifted mode DEFAULT for EUSART_STATUS      */
#define EUSART_STATUS_TXENS                     (0x1UL << 1)                            /**< Transmitter Enable Status                   */
#define _EUSART_STATUS_TXENS_SHIFT              1                                       /**< Shift value for EUSART_TXENS                */
#define _EUSART_STATUS_TXENS_MASK               0x2UL                                   /**< Bit mask for EUSART_TXENS                   */
#define _EUSART_STATUS_TXENS_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for EUSART_STATUS              */
#define EUSART_STATUS_TXENS_DEFAULT             (_EUSART_STATUS_TXENS_DEFAULT << 1)     /**< Shifted mode DEFAULT for EUSART_STATUS      */
#define EUSART_STATUS_RXBLOCK                   (0x1UL << 3)                            /**< Block Incoming Data                         */
#define _EUSART_STATUS_RXBLOCK_SHIFT            3                                       /**< Shift value for EUSART_RXBLOCK              */
#define _EUSART_STATUS_RXBLOCK_MASK             0x8UL                                   /**< Bit mask for EUSART_RXBLOCK                 */
#define _EUSART_STATUS_RXBLOCK_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for EUSART_STATUS              */
#define EUSART_STATUS_RXBLOCK_DEFAULT           (_EUSART_STATUS_RXBLOCK_DEFAULT << 3)   /**< Shifted mode DEFAULT for EUSART_STATUS      */
#define EUSART_STATUS_TXTRI                     (0x1UL << 4)                            /**< Transmitter Tristated                       */
#define _EUSART_STATUS_TXTRI_SHIFT              4                                       /**< Shift value for EUSART_TXTRI                */
#define _EUSART_STATUS_TXTRI_MASK               0x10UL                                  /**< Bit mask for EUSART_TXTRI                   */
#define _EUSART_STATUS_TXTRI_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for EUSART_STATUS              */
#define EUSART_STATUS_TXTRI_DEFAULT             (_EUSART_STATUS_TXTRI_DEFAULT << 4)     /**< Shifted mode DEFAULT for EUSART_STATUS      */
#define EUSART_STATUS_TXC                       (0x1UL << 5)                            /**< TX Complete                                 */
#define _EUSART_STATUS_TXC_SHIFT                5                                       /**< Shift value for EUSART_TXC                  */
#define _EUSART_STATUS_TXC_MASK                 0x20UL                                  /**< Bit mask for EUSART_TXC                     */
#define _EUSART_STATUS_TXC_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for EUSART_STATUS              */
#define EUSART_STATUS_TXC_DEFAULT               (_EUSART_STATUS_TXC_DEFAULT << 5)       /**< Shifted mode DEFAULT for EUSART_STATUS      */
#define EUSART_STATUS_TXFL                      (0x1UL << 6)                            /**< TX FIFO Level                               */
#define _EUSART_STATUS_TXFL_SHIFT               6                                       /**< Shift value for EUSART_TXFL                 */
#define _EUSART_STATUS_TXFL_MASK                0x40UL                                  /**< Bit mask for EUSART_TXFL                    */
#define _EUSART_STATUS_TXFL_DEFAULT             0x00000001UL                            /**< Mode DEFAULT for EUSART_STATUS              */
#define EUSART_STATUS_TXFL_DEFAULT              (_EUSART_STATUS_TXFL_DEFAULT << 6)      /**< Shifted mode DEFAULT for EUSART_STATUS      */
#define EUSART_STATUS_RXFL                      (0x1UL << 7)                            /**< RX FIFO Level                               */
#define _EUSART_STATUS_RXFL_SHIFT               7                                       /**< Shift value for EUSART_RXFL                 */
#define _EUSART_STATUS_RXFL_MASK                0x80UL                                  /**< Bit mask for EUSART_RXFL                    */
#define _EUSART_STATUS_RXFL_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for EUSART_STATUS              */
#define EUSART_STATUS_RXFL_DEFAULT              (_EUSART_STATUS_RXFL_DEFAULT << 7)      /**< Shifted mode DEFAULT for EUSART_STATUS      */
#define EUSART_STATUS_RXFULL                    (0x1UL << 8)                            /**< RX FIFO Full                                */
#define _EUSART_STATUS_RXFULL_SHIFT             8                                       /**< Shift value for EUSART_RXFULL               */
#define _EUSART_STATUS_RXFULL_MASK              0x100UL                                 /**< Bit mask for EUSART_RXFULL                  */
#define _EUSART_STATUS_RXFULL_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for EUSART_STATUS              */
#define EUSART_STATUS_RXFULL_DEFAULT            (_EUSART_STATUS_RXFULL_DEFAULT << 8)    /**< Shifted mode DEFAULT for EUSART_STATUS      */
#define EUSART_STATUS_RXIDLE                    (0x1UL << 12)                           /**< RX Idle                                     */
#define _EUSART_STATUS_RXIDLE_SHIFT             12                                      /**< Shift value for EUSART_RXIDLE               */
#define _EUSART_STATUS_RXIDLE_MASK              0x1000UL                                /**< Bit mask for EUSART_RXIDLE                  */
#define _EUSART_STATUS_RXIDLE_DEFAULT           0x00000001UL                            /**< Mode DEFAULT for EUSART_STATUS              */
#define EUSART_STATUS_RXIDLE_DEFAULT            (_EUSART_STATUS_RXIDLE_DEFAULT << 12)   /**< Shifted mode DEFAULT for EUSART_STATUS      */
#define EUSART_STATUS_TXIDLE                    (0x1UL << 13)                           /**< TX Idle                                     */
#define _EUSART_STATUS_TXIDLE_SHIFT             13                                      /**< Shift value for EUSART_TXIDLE               */
#define _EUSART_STATUS_TXIDLE_MASK              0x2000UL                                /**< Bit mask for EUSART_TXIDLE                  */
#define _EUSART_STATUS_TXIDLE_DEFAULT           0x00000001UL                            /**< Mode DEFAULT for EUSART_STATUS              */
#define EUSART_STATUS_TXIDLE_DEFAULT            (_EUSART_STATUS_TXIDLE_DEFAULT << 13)   /**< Shifted mode DEFAULT for EUSART_STATUS      */
#define _EUSART_STATUS_TXFCNT_SHIFT             16                                      /**< Shift value for EUSART_TXFCNT               */
#define _EUSART_STATUS_TXFCNT_MASK              0x1F0000UL                              /**< Bit mask for EUSART_TXFCNT                  */
#define _EUSART_STATUS_TXFCNT_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for EUSART_STATUS              */
#define EUSART_STATUS_TXFCNT_DEFAULT            (_EUSART_STATUS_TXFCNT_DEFAULT << 16)   /**< Shifted mode DEFAULT for EUSART_STATUS      */
#define EUSART_STATUS_AUTOBAUDDONE              (0x1UL << 24)                           /**< Auto Baud Rate Detection Completed          */
#define _EUSART_STATUS_AUTOBAUDDONE_SHIFT       24                                      /**< Shift value for EUSART_AUTOBAUDDONE         */
#define _EUSART_STATUS_AUTOBAUDDONE_MASK        0x1000000UL                             /**< Bit mask for EUSART_AUTOBAUDDONE            */
#define _EUSART_STATUS_AUTOBAUDDONE_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for EUSART_STATUS              */
#define EUSART_STATUS_AUTOBAUDDONE_DEFAULT      (_EUSART_STATUS_AUTOBAUDDONE_DEFAULT << 24) /**< Shifted mode DEFAULT for EUSART_STATUS      */
#define EUSART_STATUS_CLEARTXBUSY               (0x1UL << 25)                           /**< TX FIFO Clear Busy                          */
#define _EUSART_STATUS_CLEARTXBUSY_SHIFT        25                                      /**< Shift value for EUSART_CLEARTXBUSY          */
#define _EUSART_STATUS_CLEARTXBUSY_MASK         0x2000000UL                             /**< Bit mask for EUSART_CLEARTXBUSY             */
#define _EUSART_STATUS_CLEARTXBUSY_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for EUSART_STATUS              */
#define EUSART_STATUS_CLEARTXBUSY_DEFAULT       (_EUSART_STATUS_CLEARTXBUSY_DEFAULT << 25) /**< Shifted mode DEFAULT for EUSART_STATUS      */

/* Bit fields for EUSART IF */
#define _EUSART_IF_RESETVALUE                   0x00000000UL                            /**< Default value for EUSART_IF                 */
#define _EUSART_IF_MASK                         0x030D3FFFUL                            /**< Mask for EUSART_IF                          */
#define EUSART_IF_TXC                           (0x1UL << 0)                            /**< TX Complete Interrupt Flag                  */
#define _EUSART_IF_TXC_SHIFT                    0                                       /**< Shift value for EUSART_TXC                  */
#define _EUSART_IF_TXC_MASK                     0x1UL                                   /**< Bit mask for EUSART_TXC                     */
#define _EUSART_IF_TXC_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_TXC_DEFAULT                   (_EUSART_IF_TXC_DEFAULT << 0)           /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_TXFL                          (0x1UL << 1)                            /**< TX FIFO Level Interrupt Flag                */
#define _EUSART_IF_TXFL_SHIFT                   1                                       /**< Shift value for EUSART_TXFL                 */
#define _EUSART_IF_TXFL_MASK                    0x2UL                                   /**< Bit mask for EUSART_TXFL                    */
#define _EUSART_IF_TXFL_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_TXFL_DEFAULT                  (_EUSART_IF_TXFL_DEFAULT << 1)          /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_RXFL                          (0x1UL << 2)                            /**< RX FIFO Level Interrupt Flag                */
#define _EUSART_IF_RXFL_SHIFT                   2                                       /**< Shift value for EUSART_RXFL                 */
#define _EUSART_IF_RXFL_MASK                    0x4UL                                   /**< Bit mask for EUSART_RXFL                    */
#define _EUSART_IF_RXFL_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_RXFL_DEFAULT                  (_EUSART_IF_RXFL_DEFAULT << 2)          /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_RXFULL                        (0x1UL << 3)                            /**< RX FIFO Full Interrupt Flag                 */
#define _EUSART_IF_RXFULL_SHIFT                 3                                       /**< Shift value for EUSART_RXFULL               */
#define _EUSART_IF_RXFULL_MASK                  0x8UL                                   /**< Bit mask for EUSART_RXFULL                  */
#define _EUSART_IF_RXFULL_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_RXFULL_DEFAULT                (_EUSART_IF_RXFULL_DEFAULT << 3)        /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_RXOF                          (0x1UL << 4)                            /**< RX FIFO Overflow Interrupt Flag             */
#define _EUSART_IF_RXOF_SHIFT                   4                                       /**< Shift value for EUSART_RXOF                 */
#define _EUSART_IF_RXOF_MASK                    0x10UL                                  /**< Bit mask for EUSART_RXOF                    */
#define _EUSART_IF_RXOF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_RXOF_DEFAULT                  (_EUSART_IF_RXOF_DEFAULT << 4)          /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_RXUF                          (0x1UL << 5)                            /**< RX FIFO Underflow Interrupt Flag            */
#define _EUSART_IF_RXUF_SHIFT                   5                                       /**< Shift value for EUSART_RXUF                 */
#define _EUSART_IF_RXUF_MASK                    0x20UL                                  /**< Bit mask for EUSART_RXUF                    */
#define _EUSART_IF_RXUF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_RXUF_DEFAULT                  (_EUSART_IF_RXUF_DEFAULT << 5)          /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_TXOF                          (0x1UL << 6)                            /**< TX FIFO Overflow Interrupt Flag             */
#define _EUSART_IF_TXOF_SHIFT                   6                                       /**< Shift value for EUSART_TXOF                 */
#define _EUSART_IF_TXOF_MASK                    0x40UL                                  /**< Bit mask for EUSART_TXOF                    */
#define _EUSART_IF_TXOF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_TXOF_DEFAULT                  (_EUSART_IF_TXOF_DEFAULT << 6)          /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_TXUF                          (0x1UL << 7)                            /**< TX FIFO Underflow Interrupt Flag            */
#define _EUSART_IF_TXUF_SHIFT                   7                                       /**< Shift value for EUSART_TXUF                 */
#define _EUSART_IF_TXUF_MASK                    0x80UL                                  /**< Bit mask for EUSART_TXUF                    */
#define _EUSART_IF_TXUF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_TXUF_DEFAULT                  (_EUSART_IF_TXUF_DEFAULT << 7)          /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_PERR                          (0x1UL << 8)                            /**< Parity Error Interrupt Flag                 */
#define _EUSART_IF_PERR_SHIFT                   8                                       /**< Shift value for EUSART_PERR                 */
#define _EUSART_IF_PERR_MASK                    0x100UL                                 /**< Bit mask for EUSART_PERR                    */
#define _EUSART_IF_PERR_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_PERR_DEFAULT                  (_EUSART_IF_PERR_DEFAULT << 8)          /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_FERR                          (0x1UL << 9)                            /**< Framing Error Interrupt Flag                */
#define _EUSART_IF_FERR_SHIFT                   9                                       /**< Shift value for EUSART_FERR                 */
#define _EUSART_IF_FERR_MASK                    0x200UL                                 /**< Bit mask for EUSART_FERR                    */
#define _EUSART_IF_FERR_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_FERR_DEFAULT                  (_EUSART_IF_FERR_DEFAULT << 9)          /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_MPAF                          (0x1UL << 10)                           /**< Multi-Processor Address Frame Interrupt     */
#define _EUSART_IF_MPAF_SHIFT                   10                                      /**< Shift value for EUSART_MPAF                 */
#define _EUSART_IF_MPAF_MASK                    0x400UL                                 /**< Bit mask for EUSART_MPAF                    */
#define _EUSART_IF_MPAF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_MPAF_DEFAULT                  (_EUSART_IF_MPAF_DEFAULT << 10)         /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_LOADERR                       (0x1UL << 11)                           /**< Load Error Interrupt Flag                   */
#define _EUSART_IF_LOADERR_SHIFT                11                                      /**< Shift value for EUSART_LOADERR              */
#define _EUSART_IF_LOADERR_MASK                 0x800UL                                 /**< Bit mask for EUSART_LOADERR                 */
#define _EUSART_IF_LOADERR_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_LOADERR_DEFAULT               (_EUSART_IF_LOADERR_DEFAULT << 11)      /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_CCF                           (0x1UL << 12)                           /**< Collision Check Fail Interrupt Flag         */
#define _EUSART_IF_CCF_SHIFT                    12                                      /**< Shift value for EUSART_CCF                  */
#define _EUSART_IF_CCF_MASK                     0x1000UL                                /**< Bit mask for EUSART_CCF                     */
#define _EUSART_IF_CCF_DEFAULT                  0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_CCF_DEFAULT                   (_EUSART_IF_CCF_DEFAULT << 12)          /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_TXIDLE                        (0x1UL << 13)                           /**< TX Idle Interrupt Flag                      */
#define _EUSART_IF_TXIDLE_SHIFT                 13                                      /**< Shift value for EUSART_TXIDLE               */
#define _EUSART_IF_TXIDLE_MASK                  0x2000UL                                /**< Bit mask for EUSART_TXIDLE                  */
#define _EUSART_IF_TXIDLE_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_TXIDLE_DEFAULT                (_EUSART_IF_TXIDLE_DEFAULT << 13)       /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_CSWU                          (0x1UL << 16)                           /**< CS Wake-up Interrupt Flag                   */
#define _EUSART_IF_CSWU_SHIFT                   16                                      /**< Shift value for EUSART_CSWU                 */
#define _EUSART_IF_CSWU_MASK                    0x10000UL                               /**< Bit mask for EUSART_CSWU                    */
#define _EUSART_IF_CSWU_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_CSWU_DEFAULT                  (_EUSART_IF_CSWU_DEFAULT << 16)         /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_STARTF                        (0x1UL << 18)                           /**< Start Frame Interrupt Flag                  */
#define _EUSART_IF_STARTF_SHIFT                 18                                      /**< Shift value for EUSART_STARTF               */
#define _EUSART_IF_STARTF_MASK                  0x40000UL                               /**< Bit mask for EUSART_STARTF                  */
#define _EUSART_IF_STARTF_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_STARTF_DEFAULT                (_EUSART_IF_STARTF_DEFAULT << 18)       /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_SIGF                          (0x1UL << 19)                           /**< Signal Frame Interrupt Flag                 */
#define _EUSART_IF_SIGF_SHIFT                   19                                      /**< Shift value for EUSART_SIGF                 */
#define _EUSART_IF_SIGF_MASK                    0x80000UL                               /**< Bit mask for EUSART_SIGF                    */
#define _EUSART_IF_SIGF_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_SIGF_DEFAULT                  (_EUSART_IF_SIGF_DEFAULT << 19)         /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_AUTOBAUDDONE                  (0x1UL << 24)                           /**< Auto Baud Complete Interrupt Flag           */
#define _EUSART_IF_AUTOBAUDDONE_SHIFT           24                                      /**< Shift value for EUSART_AUTOBAUDDONE         */
#define _EUSART_IF_AUTOBAUDDONE_MASK            0x1000000UL                             /**< Bit mask for EUSART_AUTOBAUDDONE            */
#define _EUSART_IF_AUTOBAUDDONE_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_AUTOBAUDDONE_DEFAULT          (_EUSART_IF_AUTOBAUDDONE_DEFAULT << 24) /**< Shifted mode DEFAULT for EUSART_IF          */
#define EUSART_IF_RXTO                          (0x1UL << 25)                           /**< RX Timeout Interrupt Flag                   */
#define _EUSART_IF_RXTO_SHIFT                   25                                      /**< Shift value for EUSART_RXTO                 */
#define _EUSART_IF_RXTO_MASK                    0x2000000UL                             /**< Bit mask for EUSART_RXTO                    */
#define _EUSART_IF_RXTO_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for EUSART_IF                  */
#define EUSART_IF_RXTO_DEFAULT                  (_EUSART_IF_RXTO_DEFAULT << 25)         /**< Shifted mode DEFAULT for EUSART_IF          */

